src/СРМ/src/DataProcessors/АРМСпециалистаПоддержки/АРМСпециалистаПоддержки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМСпециалистаПоддержки</name>
</mdclass:DataProcessor>

src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Catalogs/СпискиСтатусовЗадач/СпискиСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпискиСтатусовЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполненные</name>
      <description>Выполненные</description>
    </items>
    <items>
      <name>Закрытые</name>
      <description>Закрытые</description>
    </items>
    <items>
      <name>КВыполнению</name>
      <description>К выполнению</description>
    </items>
    <items>
      <name>НеВыполненные</name>
      <description>Не выполненные</description>
    </items>
    <items>
      <name>Новые</name>
      <description>Новые</description>
    </items>
    <items>
      <name>Отклоненные</name>
      <description>Отклоненные</description>
    </items>
    <items>
      <name>Открытые</name>
      <description>Открытые</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокСтатусов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/СРМ/src/DataProcessors/АРМСпециалистаПоддержки/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.Задача);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗадач.Отбор,"Проект",ВидСравненияКомпоновкиДанных.ВИерархии,Неопределено,,Ложь,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

	УправлениеЗадачами.УстановитьОтборыПоУмолчаниюВСпискеЗадач(ЭтотОбъект, СписокЗадач);
	
	ОтборСписокСтатусов = ПредопределенноеЗначение("Справочник.СпискиСтатусовЗадач.КВыполнению");
	ИспользоватьОтборСписокСтатусов = Истина;
	ОбновитьОтборПоСпискуСтатусов(СписокЗадач, ОтборСписокСтатусов, ИспользоватьОтборСписокСтатусов);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="НайденПроектВГлобальномПоиске" Тогда
		
		Если Не ЗначениеЗаполнено(Параметр) Тогда
			Возврат;
		КонецЕсли;
		
		Элементы.Проекты.ТекущаяСтрока=Параметр;
		Активизировать();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменилисьТрудозатраты" Тогда
		Элементы.СписокЗадач.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборСписокСтатусовПриИзменении(Элемент)
	
	ОбновитьОтборПоСпискуСтатусов(СписокЗадач, ОтборСписокСтатусов, ИспользоватьОтборСписокСтатусов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписокСтатусовПриИзменении(Элемент)
	
	ИспользоватьОтборСписокСтатусов = ЗначениеЗаполнено(ОтборСписокСтатусов);
	ОбновитьОтборПоСпискуСтатусов(СписокЗадач, ОтборСписокСтатусов, ИспользоватьОтборСписокСтатусов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗадач

&НаКлиенте
Процедура СписокЗадачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПроект = Элементы.Проекты.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ТекущийПроект) Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Проект", ТекущийПроект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.Задача.Форма.ФормаДокументаНовойЗадачи", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.СписокЗадач, СписокЗадач);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПанелиОтбора

&НаКлиенте
Процедура ПанельОтбораПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьРабочееПространство(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКонтрагентовПриАктивизацииСтроки(Элемент)
	ВыбранныйКонтрагент = Элементы.ДеревоКонтрагентов.ТекущиеДанные.Контрагент;
	Если Элементы.ДеревоКонтрагентов.ТекущиеДанные.Флаг = Ложь Тогда
		Элементы.ПанельДанныхКонтрагента.Видимость = Ложь;
		Элементы.ПанельЗадачКонтрагента.Видимость = Истина;
	Иначе
		Элементы.ПанельДанныхКонтрагента.Видимость = Истина;
		Элементы.ПанельЗадачКонтрагента.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриАктивизацииСтроки(Элемент)
	УстановитьФильтрыПоПроекту(Элементы.Проекты.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьГруппуФильтров(Команда)
	Элементы.ПанельФильтров.Видимость=Не Элементы.ПанельФильтров.Видимость;
	Если Элементы.ПанельФильтров.Видимость Тогда 
		Элементы.СвернутьГруппуФильтров.Картинка= БиблиотекаКартинок.Влево;
	Иначе
		Элементы.СвернутьГруппуФильтров.Картинка= БиблиотекаКартинок.Вправо;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УправлениеЗадачами.УстановитьУсловноеОформлениеСпискаЗадач(СписокЗадач);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРабочееПространство(ТекущаяСтраница);
	
	Для каждого ТекЭлемент Из Элементы.РабочееПространство.ПодчиненныеЭлементы Цикл
		Если ТекЭлемент.Имя <> СтрЗаменить(ТекущаяСтраница.Имя,"Страница","Панель") Тогда
			ТекЭлемент.Видимость = Ложь;
		Иначе
			ТекЭлемент.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрыПоПроекту(ТекущийПроект)
	
	МассивЭлементовОтбораПоПроекту=ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗадач.Отбор,"Проект");
	Если МассивЭлементовОтбораПоПроекту.Количество()=0 Тогда
		Если ЗначениеЗаполнено(ТекущийПроект) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗадач.Отбор,"Проект",ВидСравненияКомпоновкиДанных.ВИерархии,ТекущийПроект,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
	Иначе
		МассивЭлементовОтбораПоПроекту[0].Использование=ЗначениеЗаполнено(ТекущийПроект);
		МассивЭлементовОтбораПоПроекту[0].ПравоеЗначение=ТекущийПроект;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборПоСпискуСтатусов(Список, СписокСтатусов, ИспользоватьОтборПоСпискуСтатусов)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Статус", 
		УправлениеЗадачами.СтатусыСписка(СписокСтатусов), 
		ВидСравненияКомпоновкиДанных.ВСписке,
		, 
		ИспользоватьОтборПоСпискуСтатусов,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти
